Simulations/Tests/Turbina+Torre/constant/airfoilProperties/S809_RE750
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airfoilData
(
//   alpha   C_l    C_d
(	-20.1	0.56	0.3027	)
(	-18.1	0.67	0.3069	)
(	-16.1	0.79	0.1928	)
(	-14.2	0.84	0.0898	)
(	-12.2	-0.7	0.0553	)
(	-10.1	0.63	0.039	)
(	-8.2	0.56	0.0233	)
(	-6.1	0.64	0.0112	)
(	-4.1	0.42	-0.0004	)
(	-2.1	0.21	-0.0003	)
(	0.1	0.05	0.0029	)
(	2.0	0.3	0.0056	)
(	4.1	0.54	0.0067	)
(	6.2	0.79	0.0085	)
(	8.1	0.9	0.0127	)
(	10.2	0.93	0.0274	)
(	11.3	0.92	0.0303	)
(	12.1	0.95	0.0369	)
(	13.2	0.99	0.0509	)
(	14.2	1.01	0.0648	)
(	15.3	1.02	0.0776	)
(	16.3	1	0.0917	)
(	17.1	0.94	0.0994	)
(	18.1	0.85	0.2306	)
(	19.1	0.7	0.3142	)
(	20.1	0.66	0.3186	)
(	22.0	0.7	0.3694	)
(	24.1	0.79	0.4457	)
(	26.2	0.88	0.526	)


);
